"""Напишите функцию, для переворота строки"""


def reverse():
    string1 = '1234abcd'
    string2 = string1[::-1]
    print(string2)


reverse()
